In [53]:
import numpy as numpy
import pandas as pd

**MERGING TWO DATAFRAMES**

In [54]:
#Two dataframes

employees = pd.DataFrame({
    'employee_id': [1,2,3,4,5],
    'name' : ['john','anna','peter','linda','bob'],
    'department': ['HR',"IT",'Finance','IT',"HR"]
})

salaries = pd.DataFrame({
    'employee_id': [1,2,3,6,7],
    "salary": [60000,80000,65000,70000,90000], 
    "bonus": [5000,10000,7000,8000,12000]
})

In [55]:
employees

   employee_id   name department
0            1   john         HR
1            2   anna         IT
2            3  peter    Finance
3            4  linda         IT
4            5    bob         HR

In [56]:
salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [57]:
#merge 

pd.merge(employees,salaries)

   employee_id   name department  salary  bonus
0            1   john         HR   60000   5000
1            2   anna         IT   80000  10000
2            3  peter    Finance   65000   7000

In [58]:
pd.merge(employees,salaries ,on="employee_id") # on means on which thing you merging

   employee_id   name department  salary  bonus
0            1   john         HR   60000   5000
1            2   anna         IT   80000  10000
2            3  peter    Finance   65000   7000

In [59]:
pd.merge(employees,salaries ,on="employee_id" , how ="inner")

   employee_id   name department  salary  bonus
0            1   john         HR   60000   5000
1            2   anna         IT   80000  10000
2            3  peter    Finance   65000   7000

In [60]:
pd.merge(employees,salaries ,on="employee_id" , how ="outer")

   employee_id   name department   salary    bonus
0            1   john         HR  60000.0   5000.0
1            2   anna         IT  80000.0  10000.0
2            3  peter    Finance  65000.0   7000.0
3            4  linda         IT      NaN      NaN
4            5    bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [61]:
pd.merge(employees,salaries ,on="employee_id" , how ="left")# base on employee id

   employee_id   name department   salary    bonus
0            1   john         HR  60000.0   5000.0
1            2   anna         IT  80000.0  10000.0
2            3  peter    Finance  65000.0   7000.0
3            4  linda         IT      NaN      NaN
4            5    bob         HR      NaN      NaN

In [62]:
pd.merge(employees,salaries ,on="employee_id" , how ="right") #based on salary

   employee_id   name department  salary  bonus
0            1   john         HR   60000   5000
1            2   anna         IT   80000  10000
2            3  peter    Finance   65000   7000
3            6    NaN        NaN   70000   8000
4            7    NaN        NaN   90000  12000

**CONCATINATION**

In [63]:
df1 = pd.DataFrame({
    'A': ['A0',"A1","A2"], 
    'B': ['B0',"B1","B2"],
    'C': ['C0',"C1","C2"]
})

df2 = pd.DataFrame({
    "A":['A3','A4','A5'], 
    "B":['B3','B4','B5'],
    "C":['C3','C4','C5']
})

In [64]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [65]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [66]:
pd.concat([df1,df2])  #on basis of column

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [67]:
#basis of row
pd.concat([df1,df2],axis =1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

**JOINING TWO DATAFRAMES**

In [68]:
df1 = pd.DataFrame({
    'name' : ['alice','bob','charlie']
},index= [1,2,3])


df2 = pd.DataFrame({
    'score' : [85,90,75]
},index= [2,3,4])

In [69]:
df1

      name
1    alice
2      bob
3  charlie

In [70]:
df2

   score
2     85
3     90
4     75

In [71]:
df1.join(df2)

      name  score
1    alice    NaN
2      bob   85.0
3  charlie   90.0

In [72]:
df1.join(df2,how='outer')

      name  score
1    alice    NaN
2      bob   85.0
3  charlie   90.0
4      NaN   75.0

In [77]:
df1=pd.DataFrame({
    "id": [1,2,3], 
    "name": ['Ram',"Shyam","Aman"]
})
df2=pd.DataFrame({
    'id':[2,3,4],
    'marks':[80,90,85]
})

In [79]:
pd.merge(df1,df2 ,on="id")

   id   name  marks
0   2  Shyam     80
1   3   Aman     90

In [80]:
pd.merge(df1,df2 ,on="id" , how="inner")

   id   name  marks
0   2  Shyam     80
1   3   Aman     90

In [81]:
pd.merge(df1,df2 ,on="id" , how="outer")

   id   name  marks
0   1    Ram    NaN
1   2  Shyam   80.0
2   3   Aman   90.0
3   4    NaN   85.0

In [83]:
pd.merge(df1,df2 ,on="id" , how="left")

   id   name  marks
0   1    Ram    NaN
1   2  Shyam   80.0
2   3   Aman   90.0

In [84]:
pd.merge(df1,df2 ,on="id" , how="right")

   id   name  marks
0   2  Shyam     80
1   3   Aman     90
2   4    NaN     85

In [ ]:
pd.concat()